package com.dzf.zxkj.platform.model.tax.chk;

public class TaxRptChk10412_beijing {
	public static String[] saCheckCondition = new String[] {
			//主表
			//第6行＝表A201010第41行
			"A200000所得税月（季）度预缴纳税申报表!I14 == A201010免税收入、减计收入、所得减免等优惠明细表!F46",
			//第7行＝表A201020第5行第5列
			"A200000所得税月（季）度预缴纳税申报表!I15 == A201020固定资产加速折旧（扣除）优惠明细表!G11",
			//第9行=表A201030小微企业实际利润额累计金额
			"A200000所得税月（季）度预缴纳税申报表!I17 == A201030减免所得税优惠明细表!C5",
			//第12行＝表A201030第30行
			"A200000所得税月（季）度预缴纳税申报表!I20 == A201030减免所得税优惠明细表!G36"
			
	};
}
