package com.dzf.zxkj.platform.model.tax.chk;

public class TaxRptChk10102_guangxi {
	public static String[] saCheckCondition = new String[] {
			//主表
			//E列
			"增值税纳税申报表!E7 >= 增值税纳税申报表!E8 + 增值税纳税申报表!E9",
			"增值税纳税申报表!E13 >= 增值税纳税申报表!E14",
			"增值税纳税申报表!E19 >= 增值税纳税申报表!E20",
			"增值税纳税申报表!E23 >= SUM(增值税纳税申报表!E24 : 增值税纳税申报表!E25)",
			
			//F列
			"增值税纳税申报表!F7 >= 增值税纳税申报表!F8 + 增值税纳税申报表!F9",
			"增值税纳税申报表!F10 >= 增值税纳税申报表!F11 + 增值税纳税申报表!F12",
			"增值税纳税申报表!F19 >= 增值税纳税申报表!F20",
			"增值税纳税申报表!F23 >= 增值税纳税申报表!F24 + 增值税纳税申报表!F25",
//			
//			//G列
//			"增值税纳税申报表!G8 >= 增值税纳税申报表!G9 + 增值税纳税申报表!G10",
//			"增值税纳税申报表!G14 >= 增值税纳税申报表!G15",
//			"增值税纳税申报表!G16 == SUM(增值税纳税申报表!G17 : G19)",
//			"增值税纳税申报表!G20 >= 增值税纳税申报表!G21",
//			"增值税纳税申报表!G24 >= 增值税纳税申报表!G25 + 增值税纳税申报表!G26",
//			
//			//H列
//			"增值税纳税申报表!H8 >= 增值税纳税申报表!H9 + 增值税纳税申报表!H10",
//			"增值税纳税申报表!H11 >= 增值税纳税申报表!H12 + 增值税纳税申报表!H13",
//			"增值税纳税申报表!H16 == SUM(增值税纳税申报表!H17 : H19)",
//			"增值税纳税申报表!H20 >= 增值税纳税申报表!H21",
//			"增值税纳税申报表!H24 >= 增值税纳税申报表!H25 + 增值税纳税申报表!H26",
			
			//增值税纳税申报表（小规模纳税人适用）附列资料
			"增值税纳税申报表（小规模纳税人适用）附列资料!D8 <= 增值税纳税申报表（小规模纳税人适用）附列资料!D6 + 增值税纳税申报表（小规模纳税人适用）附列资料!D7",
			"增值税纳税申报表（小规模纳税人适用）附列资料!D8 <= 增值税纳税申报表（小规模纳税人适用）附列资料!D10",
			"增值税纳税申报表（小规模纳税人适用）附列资料!D16 <= 增值税纳税申报表（小规模纳税人适用）附列资料!D14 + 增值税纳税申报表（小规模纳税人适用）附列资料!D15",
			"增值税纳税申报表（小规模纳税人适用）附列资料!D16 <= 增值税纳税申报表（小规模纳税人适用）附列资料!D18",
			
			//增值税减免税申报明细表
//			免税项目，第1列“免征增值税项目销售额” ，本列“合计”等于主表第12行“其他免税销售额”“本期数”
//			"增值税减免税申报明细表!D17 == 增值税纳税申报表!E17 + 增值税纳税申报表!F17",

//			"增值税减免税申报明细表!G8 <= 增值税减免税申报明细表!F8",
			"增值税减免税申报明细表!G9 <= 增值税减免税申报明细表!F9",
			"增值税减免税申报明细表!G10 <= 增值税减免税申报明细表!F10",
			"增值税减免税申报明细表!G11 <= 增值税减免税申报明细表!F11",
			"增值税减免税申报明细表!G12 <= 增值税减免税申报明细表!F12",
			"增值税减免税申报明细表!G13 <= 增值税减免税申报明细表!F13"
			
			
	};
}
