package com.dzf.zxkj.platform.model.tax.chk;

public class TaxRptChk10101_beijing {
	public static String[] saCheckCondition = new String[] {
			//主表
//			主表第5栏“一般项目”列“本月数”≥《附列资料（一）》第9列第8至13b行之和-第9列第14、15行之和
			"增值税纳税申报表（适用于增值税一般纳税人）!G16 >= SUM(增值税纳税申报表附列资料（一）!M15 : M23) - SUM(增值税纳税申报表附列资料（一）!M24 : M25)",
			"增值税纳税申报表（适用于增值税一般纳税人）!L16 >= SUM(增值税纳税申报表附列资料（一）!M24 : M25)",

			
//			主表第12栏“一般项目”列“本月数”+“即征即退项目”列“本月数”＝《附列资料（二）》第12栏“税额”
			"增值税纳税申报表（适用于增值税一般纳税人）!G23 + 增值税纳税申报表（适用于增值税一般纳税人）!L23 == 增值税纳税申报表附列资料（二）!E20",
//			主表第14栏“一般项目”列“本月数”+“即征即退项目”列“本月数”＝《附列资料（二）》第13栏“税额”
			"增值税纳税申报表（适用于增值税一般纳税人）!G25 + 增值税纳税申报表（适用于增值税一般纳税人）!L25 == 增值税纳税申报表附列资料（二）!C23",
			
//			"增值税纳税申报表!G25 <= SUM(增值税纳税申报表附列资料（一）!L8 : L12) + 增值税纳税申报表附列资料（二）!C27",
//			//G列
//			"增值税纳税申报表（适用于增值税一般纳税人）!G12 >= SUM(增值税纳税申报表（适用于增值税一般纳税人）!G13 : G15)",
			"增值税纳税申报表（适用于增值税一般纳税人）!G16 >= 增值税纳税申报表（适用于增值税一般纳税人）!G17",
			"增值税纳税申报表（适用于增值税一般纳税人）!G19 >= SUM(增值税纳税申报表（适用于增值税一般纳税人）!G20 : G21)",
//			//K列
//			"增值税纳税申报表!K10 >= SUM(增值税纳税申报表!K11 : K13)",
//			"增值税纳税申报表!K14 >= 增值税纳税申报表!K15",
//			"增值税纳税申报表!K17 >= SUM(增值税纳税申报表!K18 : KL19)",
//			//L列
			"增值税纳税申报表（适用于增值税一般纳税人）!L12 >= SUM(增值税纳税申报表（适用于增值税一般纳税人）!L13 : L15)",
			"增值税纳税申报表（适用于增值税一般纳税人）!L16 >= 增值税纳税申报表（适用于增值税一般纳税人）!L17",
//			
//			//M列
//			"增值税纳税申报表!M10 >= SUM(增值税纳税申报表!M11 : M13)",
//			"增值税纳税申报表!M14 >= 增值税纳税申报表!M15",
//
//			
//			//>=0
			"增值税纳税申报表（适用于增值税一般纳税人）!G44 >= 0",
			"增值税纳税申报表（适用于增值税一般纳税人）!L44 >= 0",
//			
			"增值税纳税申报表（适用于增值税一般纳税人）!G43 >= 增值税纳税申报表（适用于增值税一般纳税人）!G44",
			"增值税纳税申报表（适用于增值税一般纳税人）!L43 >= 增值税纳税申报表（适用于增值税一般纳税人）!L44",
//			
//			主表第23栏应纳税额减征额不能大于19栏应纳税额与21栏简易计税办法计算的应纳税额的合计数
//			G34<=G30+G32
//			L34<=L30+L32

			"增值税纳税申报表（适用于增值税一般纳税人）!G34 <= 增值税纳税申报表（适用于增值税一般纳税人）!G30 + 增值税纳税申报表（适用于增值税一般纳税人）!G32",
			"增值税纳税申报表（适用于增值税一般纳税人）!L34 <= 增值税纳税申报表（适用于增值税一般纳税人）!L30 + 增值税纳税申报表（适用于增值税一般纳税人）!L32",

//			主表第9栏+第10栏数据必须等于附表一第18行第9列数据  G20+G21=M28   2017-01-11增加
			//"SUM(增值税纳税申报表（适用于增值税一般纳税人）!G20 : G21) == 增值税纳税申报表附列资料（一）!M28",
			
			//			
//			
//			
			//增值税纳税申报表附列资料（四）
			//4<=3
			"增值税纳税申报表附列资料（四）!F8 <= 增值税纳税申报表附列资料（四）!E8",
			"增值税纳税申报表附列资料（四）!F9 <= 增值税纳税申报表附列资料（四）!E9",
			"增值税纳税申报表附列资料（四）!F10 <= 增值税纳税申报表附列资料（四）!E10",
			"增值税纳税申报表附列资料（四）!F11 <= 增值税纳税申报表附列资料（四）!E11",
			"增值税纳税申报表附列资料（四）!F12 <= 增值税纳税申报表附列资料（四）!E12",
			
			//增值税纳税申报表附列资料（五）
			//3≤1+2+4
//			"增值税纳税申报表附列资料（五）!C7 <= 增值税纳税申报表附列资料（五）!A7 + 增值税纳税申报表附列资料（五）!B7 + 增值税纳税申报表附列资料（五）!D7",
//			//5≤1+4
//			"增值税纳税申报表附列资料（五）!E7 <= 增值税纳税申报表附列资料（五）!A7 + 增值税纳税申报表附列资料（五）!D7",
//			//《增值税纳税申报表附列资料（五）》 第4列“本期转入的待抵扣不动产进项税额” ≤《附列资料（二）》第23栏“税额”。
//			"增值税纳税申报表附列资料（五）!D7 <= 增值税纳税申报表附列资料（二）!C33",
			
			//增值税减免税申报明细表  一、减税项目 4<=3
			"增值税减免税申报明细表!G8 <= 增值税减免税申报明细表!F8",
			"增值税减免税申报明细表!G9 <= 增值税减免税申报明细表!F9",
			"增值税减免税申报明细表!G10 <= 增值税减免税申报明细表!F10",
			"增值税减免税申报明细表!G11 <= 增值税减免税申报明细表!F11",
			"增值税减免税申报明细表!G12 <= 增值税减免税申报明细表!F12",
//			"增值税减免税申报明细表!G13 <= 增值税减免税申报明细表!F13",
			//表间校验
//			《增值税减免税申报明细表》二、免税项目，第1列“合计”等于主表第8行“一般项目”列“本月数”。
//			"增值税减免税申报明细表!D17 == 增值税纳税申报表（适用于增值税一般纳税人）!G19",
			
//			主表第23行应纳税额减征额1、3列之和必须等于增值税减免税申报明细表减免项目第4列第1行本期实际抵减税额
//			"增值税纳税申报表（适用于增值税一般纳税人）!G34 +增值税纳税申报表（适用于增值税一般纳税人）!L34 == 增值税减免税申报明细表!G8",
//			
//			
			
//			//代扣代缴税收通用缴款书抵扣清单
//			"代扣代缴税收通用缴款书抵扣清单!F27 == 增值税纳税申报表附列资料（二）!E13",
//			
//			//应税服务减免项目清单表
//			"应税服务减免项目清单表!G25 == SUM(增值税纳税申报表附列资料（三）!D8 : D15)",
			
			//本期抵扣进项税额结构明细表
			//C栏金额
//			"本期抵扣进项税额结构明细表!C8 >= 本期抵扣进项税额结构明细表!C9",
//			"本期抵扣进项税额结构明细表!C11 >= 本期抵扣进项税额结构明细表!C12 + 本期抵扣进项税额结构明细表!C13 + 本期抵扣进项税额结构明细表!C14 + 本期抵扣进项税额结构明细表!C15 + 本期抵扣进项税额结构明细表!C16",
//			"本期抵扣进项税额结构明细表!C17 >= 本期抵扣进项税额结构明细表!C18 + 本期抵扣进项税额结构明细表!C19 + 本期抵扣进项税额结构明细表!C20 + 本期抵扣进项税额结构明细表!C21",
//			"本期抵扣进项税额结构明细表!C22 >= 本期抵扣进项税额结构明细表!C23",
//			"本期抵扣进项税额结构明细表!C24 >= 本期抵扣进项税额结构明细表!C25 + 本期抵扣进项税额结构明细表!C26 + 本期抵扣进项税额结构明细表!C27 + 本期抵扣进项税额结构明细表!C28 + 本期抵扣进项税额结构明细表!C29 + 本期抵扣进项税额结构明细表!C30 + 本期抵扣进项税额结构明细表!C31 + 本期抵扣进项税额结构明细表!C32",
//			//D栏税额
//			"本期抵扣进项税额结构明细表!D8 >= 本期抵扣进项税额结构明细表!D9",
//			"本期抵扣进项税额结构明细表!D11 >= 本期抵扣进项税额结构明细表!D12 + 本期抵扣进项税额结构明细表!D13 + 本期抵扣进项税额结构明细表!D14 + 本期抵扣进项税额结构明细表!D15 + 本期抵扣进项税额结构明细表!D16",
//			"本期抵扣进项税额结构明细表!D17 >= 本期抵扣进项税额结构明细表!D18 + 本期抵扣进项税额结构明细表!D19 + 本期抵扣进项税额结构明细表!D20 + 本期抵扣进项税额结构明细表!D21",
//			"本期抵扣进项税额结构明细表!D22 >= 本期抵扣进项税额结构明细表!D23",
//			"本期抵扣进项税额结构明细表!D24 >= 本期抵扣进项税额结构明细表!D25 + 本期抵扣进项税额结构明细表!D26 + 本期抵扣进项税额结构明细表!D27 + 本期抵扣进项税额结构明细表!D28 + 本期抵扣进项税额结构明细表!D29 + 本期抵扣进项税额结构明细表!D30 + 本期抵扣进项税额结构明细表!D31 + 本期抵扣进项税额结构明细表!D32",
			//表间校验
			//"本期抵扣进项税额结构明细表!D6 == 增值税纳税申报表附列资料（二）!E19 - 增值税纳税申报表附列资料（二）!E18",
			

	};
}
