package com.dzf.zxkj.platform.model.tax.chk;

public class TaxRptChk10101 {
	public static String[] saCheckCondition = new String[] {
			//主表
			"增值税纳税申报表!G14 >= SUM(增值税纳税申报表附列资料（一）!M15 : M23) - SUM(增值税纳税申报表附列资料（一）!M24 : M25)",
			"增值税纳税申报表!L14 >= SUM(增值税纳税申报表附列资料（一）!M24 : M25)",
			"增值税纳税申报表!G25 <= SUM(增值税纳税申报表附列资料（一）!L8 : L12) + 增值税纳税申报表附列资料（二）!C27",
			//G列
			"增值税纳税申报表!G10 >= SUM(增值税纳税申报表!G11 : G13)",
			"增值税纳税申报表!G14 >= 增值税纳税申报表!G15",
			"增值税纳税申报表!G17 >= SUM(增值税纳税申报表!G18 : G19)",
			//K列
			"增值税纳税申报表!K10 >= SUM(增值税纳税申报表!K11 : K13)",
			"增值税纳税申报表!K14 >= 增值税纳税申报表!K15",
			"增值税纳税申报表!K17 >= SUM(增值税纳税申报表!K18 : KL19)",
			//L列
			"增值税纳税申报表!L10 >= SUM(增值税纳税申报表!L11 : L13)",
			"增值税纳税申报表!L14 >= 增值税纳税申报表!L15",
			
			//M列
			"增值税纳税申报表!M10 >= SUM(增值税纳税申报表!M11 : M13)",
			"增值税纳税申报表!M14 >= 增值税纳税申报表!M15",

			
			//>=0
			"增值税纳税申报表!G42 >= 0",
			"增值税纳税申报表!L42 >= 0",
			
			"增值税纳税申报表!G41 >= 增值税纳税申报表!G42",
			"增值税纳税申报表!L41 >= 增值税纳税申报表!L42",
			
			//增值税纳税申报表附列资料（一）
			"增值税纳税申报表附列资料（一）!O12 == 增值税纳税申报表附列资料（三）!B10 + 增值税纳税申报表附列资料（三）!B11",
			"增值税纳税申报表附列资料（一）!O17 == 增值税纳税申报表附列资料（三）!B12",
			
			
			//增值税纳税申报表附列资料（三） 5<=1
			"增值税纳税申报表附列资料（三）!F8 <= 增值税纳税申报表附列资料（三）!B8 ",
			"增值税纳税申报表附列资料（三）!F9 <= 增值税纳税申报表附列资料（三）!B9 ",
			"增值税纳税申报表附列资料（三）!F10 <= 增值税纳税申报表附列资料（三）!B10 ",
			"增值税纳税申报表附列资料（三）!F11 <= 增值税纳税申报表附列资料（三）!B11 ",
			"增值税纳税申报表附列资料（三）!F12 <= 增值税纳税申报表附列资料（三）!B12 ",
			"增值税纳税申报表附列资料（三）!F13 <= 增值税纳税申报表附列资料（三）!B13 ",
			"增值税纳税申报表附列资料（三）!F14 <= 增值税纳税申报表附列资料（三）!B14 ",
			"增值税纳税申报表附列资料（三）!F15 <= 增值税纳税申报表附列资料（三）!B15 ",
			//5<=4
			"增值税纳税申报表附列资料（三）!F8 <= 增值税纳税申报表附列资料（三）!E8 ",
			"增值税纳税申报表附列资料（三）!F9 <= 增值税纳税申报表附列资料（三）!E9 ",
			"增值税纳税申报表附列资料（三）!F10 <= 增值税纳税申报表附列资料（三）!E10 ",
			"增值税纳税申报表附列资料（三）!F11 <= 增值税纳税申报表附列资料（三）!E11 ",
			"增值税纳税申报表附列资料（三）!F12 <= 增值税纳税申报表附列资料（三）!E12 ",
			"增值税纳税申报表附列资料（三）!F13 <= 增值税纳税申报表附列资料（三）!E13 ",
			"增值税纳税申报表附列资料（三）!F14 <= 增值税纳税申报表附列资料（三）!E14 ",
			"增值税纳税申报表附列资料（三）!F15 <= 增值税纳税申报表附列资料（三）!E15 ",
			
			//增值税纳税申报表附列资料（四）
			//4<=3
			"增值税纳税申报表附列资料（四）!F7 <= 增值税纳税申报表附列资料（四）!E7",
			"增值税纳税申报表附列资料（四）!F8 <= 增值税纳税申报表附列资料（四）!E8",
			"增值税纳税申报表附列资料（四）!F9 <= 增值税纳税申报表附列资料（四）!E9",
			"增值税纳税申报表附列资料（四）!F10 <= 增值税纳税申报表附列资料（四）!E10",
			"增值税纳税申报表附列资料（四）!F11 <= 增值税纳税申报表附列资料（四）!E11",
			
			
			//增值税纳税申报表附列资料（五）
			//3≤1+2+4
			"增值税纳税申报表附列资料（五）!C7 <= 增值税纳税申报表附列资料（五）!A7 + 增值税纳税申报表附列资料（五）!B7 + 增值税纳税申报表附列资料（五）!D7",
			//5≤1+4
			"增值税纳税申报表附列资料（五）!E7 <= 增值税纳税申报表附列资料（五）!A7 + 增值税纳税申报表附列资料（五）!D7",
			
			//增值税减免税申报明细表  一、减税项目 4<=3
			"增值税减免税申报明细表!G8 <= 增值税减免税申报明细表!F8",
			"增值税减免税申报明细表!G9 <= 增值税减免税申报明细表!F9",
			"增值税减免税申报明细表!G10 <= 增值税减免税申报明细表!F10",
			"增值税减免税申报明细表!G11 <= 增值税减免税申报明细表!F11",
			"增值税减免税申报明细表!G12 <= 增值税减免税申报明细表!F12",
			"增值税减免税申报明细表!G13 <= 增值税减免税申报明细表!F13",
			
			
			//代扣代缴税收通用缴款书抵扣清单
			"代扣代缴税收通用缴款书抵扣清单!F27 == 增值税纳税申报表附列资料（二）!E13",
			
			//应税服务减免项目清单表
			"应税服务减免项目清单表!G25 == SUM(增值税纳税申报表附列资料（三）!D8 : D15)",
			
			//本期抵扣进项税额结构明细表
			//C栏金额
			"本期抵扣进项税额结构明细表!C7 >= 本期抵扣进项税额结构明细表!C8",
			"本期抵扣进项税额结构明细表!C10 >= 本期抵扣进项税额结构明细表!C11 + 本期抵扣进项税额结构明细表!C12 + 本期抵扣进项税额结构明细表!C13 + 本期抵扣进项税额结构明细表!C14 + 本期抵扣进项税额结构明细表!C15",
			"本期抵扣进项税额结构明细表!C16 >= 本期抵扣进项税额结构明细表!C17 + 本期抵扣进项税额结构明细表!C18 + 本期抵扣进项税额结构明细表!C19 + 本期抵扣进项税额结构明细表!C20",
			"本期抵扣进项税额结构明细表!C21 >= 本期抵扣进项税额结构明细表!C22",
			"本期抵扣进项税额结构明细表!C23 >= 本期抵扣进项税额结构明细表!C24 + 本期抵扣进项税额结构明细表!C25 + 本期抵扣进项税额结构明细表!C26 + 本期抵扣进项税额结构明细表!C27 + 本期抵扣进项税额结构明细表!C28 + 本期抵扣进项税额结构明细表!C29 + 本期抵扣进项税额结构明细表!C30 + 本期抵扣进项税额结构明细表!C31",
			//D栏税额
			"本期抵扣进项税额结构明细表!D7 >= 本期抵扣进项税额结构明细表!D8",
			"本期抵扣进项税额结构明细表!D10 >= 本期抵扣进项税额结构明细表!D11 + 本期抵扣进项税额结构明细表!D12 + 本期抵扣进项税额结构明细表!D13 + 本期抵扣进项税额结构明细表!D14 + 本期抵扣进项税额结构明细表!D15",
			"本期抵扣进项税额结构明细表!D16 >= 本期抵扣进项税额结构明细表!D17 + 本期抵扣进项税额结构明细表!D18 + 本期抵扣进项税额结构明细表!D19 + 本期抵扣进项税额结构明细表!D20",
			"本期抵扣进项税额结构明细表!D21 >= 本期抵扣进项税额结构明细表!D22",
			"本期抵扣进项税额结构明细表!D23 >= 本期抵扣进项税额结构明细表!D24 + 本期抵扣进项税额结构明细表!D25 + 本期抵扣进项税额结构明细表!D26 + 本期抵扣进项税额结构明细表!D27 + 本期抵扣进项税额结构明细表!D28 + 本期抵扣进项税额结构明细表!D29 + 本期抵扣进项税额结构明细表!D30 + 本期抵扣进项税额结构明细表!D31",
			//表间校验
			"本期抵扣进项税额结构明细表!D5 == 增值税纳税申报表附列资料（二）!E18 - 增值税纳税申报表附列资料（二）!E17",
			

	};
}
